html/org-pages/qc/week11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-23 Sun 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 11 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 11 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 11 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5698229">Week 11 - Quantum Key Distribuition: Part 2</a>
<ul>
<li><a href="#orgb17fed8">Recap</a></li>
</ul>
</li>
<li><a href="#org1ed0470">QKD Part 2: Eve returns (imp smiling)</a>
<ul>
<li><a href="#orge2a2342">Eve&rsquo;s work</a></li>
<li><a href="#org2c62538">Receiver&rsquo;s work</a></li>
<li><a href="#org3e95273">Comparison</a></li>
</ul>
</li>
<li><a href="#orgdc6fd9a">Other QKD protocols</a>
<ul>
<li><a href="#org7b38beb">B92 protocol</a></li>
<li><a href="#orgeec4cf8">E91 protocol</a></li>
</ul>
</li>
<li><a href="#org191dbc0">QKD in the real world</a>
<ul>
<li><a href="#org5c3c255">Differences</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5698229" class="outline-2">
<h2 id="org5698229">Week 11 - Quantum Key Distribuition: Part 2</h2>
<div class="outline-text-2" id="text-org5698229">
</div>
<div id="outline-container-orgb17fed8" class="outline-3">
<h3 id="orgb17fed8">Recap</h3>
<div class="outline-text-3" id="text-orgb17fed8">
</div>
<div id="outline-container-org36e7d46" class="outline-4">
<h4 id="org36e7d46">The Key</h4>
<div class="outline-text-4" id="text-org36e7d46">
<ul class="org-ul">
<li>It is a series of classical bits</li>
<li>It is used to encode and decode the party messages</li>
<li>in QKD, the key is developed together</li>
<li>QKD helps us construct and send a truly secure key</li>
<li>Quantum measurement guarantees that we know if there was an eavesdropper listening</li>
</ul>
</div>
</div>
<div id="outline-container-orgca9a356" class="outline-4">
<h4 id="orgca9a356">QKD protocol</h4>
<div class="outline-text-4" id="text-orgca9a356">
</div>
<div id="outline-container-orgd871ac0" class="outline-5">
<h5 id="orgd871ac0">Phase 1: Sending</h5>
<div class="outline-text-5" id="text-orgd871ac0">
<ol class="org-ol">
<li>Sender randomly picks some classical bits</li>
<li>Sender randomly chooses a basis (Z or X) to each bit.</li>
<li>Sender encondes each classical bit in a qubit using the rules the party agreed on.</li>
<li>Sender sends the qubits using a quantum channel</li>
</ol>
</div>
</div>
<div id="outline-container-org87ef0ad" class="outline-5">
<h5 id="org87ef0ad">Phase 2: Receiving</h5>
<div class="outline-text-5" id="text-org87ef0ad">
<ol class="org-ol">
<li>Receiver ramdonly picks bases</li>
<li>Receiver measures the qubits with his/her chosen bases to get new quantum states</li>
<li>Receiver decodes the states of his measured qubits into bits</li>
</ol>
</div>
</div>
<div id="outline-container-org0478a24" class="outline-5">
<h5 id="org0478a24">Phase 3: Comparing</h5>
<div class="outline-text-5" id="text-org0478a24">
<ol class="org-ol">
<li>Sender and receiver compare bases using the classical channel and eliminate the ones that their bases didn&rsquo;t match up.</li>
<li>Sender and receiver compare bits over the classical channel</li>
</ol>
</div>
</div>
<div id="outline-container-org8d7ae93" class="outline-5">
<h5 id="org8d7ae93">Importance of second step in third phase</h5>
<div class="outline-text-5" id="text-org8d7ae93">
<ul class="org-ul">
<li>If their bits are not the same, it means someone eveasdropped</li>
<li>Remember, when we measure quantum states, they can change</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ed0470" class="outline-2">
<h2 id="org1ed0470">QKD Part 2: Eve returns (imp smiling)</h2>
<div class="outline-text-2" id="text-org1ed0470">
<ul class="org-ul">
<li>Phase will be slightly different:
<ul class="org-ul">
<li>Someone will intecerpt the qubits before Bob can measure them.</li>
</ul></li>
<li>When agreeing upon the bases and the table, we gotta consider Eve knowing them too</li>
</ul>
</div>
<div id="outline-container-orge2a2342" class="outline-3">
<h3 id="orge2a2342">Eve&rsquo;s work</h3>
<div class="outline-text-3" id="text-orge2a2342">
<ul class="org-ul">
<li>He intercepts the qubits sent</li>
<li>Then, he chooses bases (at random) to figure out the bits (he is measuring)</li>
<li>Of course, as Eve used some different basis than the sender used, his measurements contain differences from the previous ones.</li>
<li>Even, to remain undetected, needs to send off those results to the receiver</li>
</ul>
</div>
</div>
<div id="outline-container-org2c62538" class="outline-3">
<h3 id="org2c62538">Receiver&rsquo;s work</h3>
<div class="outline-text-3" id="text-org2c62538">
<ul class="org-ul">
<li>They choose random bases to figure out the bits</li>
<li>They decode qubits back to bits using his random bases and the table previously agreed on</li>
</ul>
</div>
</div>
<div id="outline-container-org3e95273" class="outline-3">
<h3 id="org3e95273">Comparison</h3>
<div class="outline-text-3" id="text-org3e95273">
<ul class="org-ul">
<li>Sender and receiver compare their bases and cross off the ones tha don&rsquo;t match</li>
<li>Afterwards, they check to see if their bits are the same (and it is not!)</li>
<li>After knowing there is an eavesdropper on the line, they need to go and find a more secure method of communicating</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdc6fd9a" class="outline-2">
<h2 id="orgdc6fd9a">Other QKD protocols</h2>
<div class="outline-text-2" id="text-orgdc6fd9a">
<ul class="org-ul">
<li>The QKD protocol we&rsquo;ve been learning is AKA BB84 procotol. It was invented by Bennet and Brassard in 1984</li>
</ul>
</div>
<div id="outline-container-org7b38beb" class="outline-3">
<h3 id="org7b38beb">B92 protocol</h3>
<div class="outline-text-3" id="text-org7b38beb">
<ul class="org-ul">
<li>Sender uses two states to enconde - \(|0\rangle\) \(|+\rangle\) - Notice that these two states are still in different bases (Z and X).</li>
</ul>
</div>
</div>
<div id="outline-container-orgeec4cf8" class="outline-3">
<h3 id="orgeec4cf8">E91 protocol</h3>
<div class="outline-text-3" id="text-orgeec4cf8">
<ul class="org-ul">
<li>This protocol uses entenglement - Sender and receiver have one qubit each, and the two qubits are entangled. The key is generated using these shared, entangled qubits</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org191dbc0" class="outline-2">
<h2 id="org191dbc0">QKD in the real world</h2>
<div class="outline-text-2" id="text-org191dbc0">
<ul class="org-ul">
<li>Many quantum algorithms &amp; protocols are not yet usable, because they assume perfect, fault-tolerant hardware
<ul class="org-ul">
<li>These are called long-term algorithms</li>
</ul></li>
<li>However, we can start implementing QKD right now!</li>
</ul>
</div>
<div id="outline-container-org5c3c255" class="outline-3">
<h3 id="org5c3c255">Differences</h3>
<div class="outline-text-3" id="text-org5c3c255">
<ul class="org-ul">
<li>QKD protocols have multiple components, such as devices, medium, distance between senders, cost of implementation</li>
<li>Therefore, different QKD protocols are used for different use cases.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-01-23 Sun 15:59</p>
</div>
</body>
</html>
